AccumulationRegisters/кб99_РезервПартийВСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>кб99_РезервПартийВСД</Name>
			<Comment>Резервирование партий ВСД при подборе в ВСД2_транзакцию. Снимается при получении ответа Ветис.</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВСД2_Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_Производство</Name>
			<Comment>api 2.*</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.кб_НезавершенныеПроизводственныеТранзакции</xr:Item>
				<xr:Item>AccumulationRegister.кб99_ОстаткиПартийВСД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Производитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ-основание</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>cargoInspected</Name>
					<Comment>Отметка об обследовании партии продукции ветеринарным врачом.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатыИсследований</Name>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_РезультатИсследования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>operationId</Name>
					<Comment>№ транзакции при НЗП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершитьОперацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСрокГодности2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Продукция</Name>
					<Comment>Можно фасовку добавить</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приход</Name>
							<Comment>1 - приход,0 - расход</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПродукции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скоропортящийся</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Некачественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСрокГодности2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПартии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество1с</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииСписания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ВидПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция_Элемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Продукция_Элемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УровниУпаковки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормаУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_ФормыУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маркировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерУровня</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_УровниУпаковки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_Маркировка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маркировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПродукции</Name>
							<Comment>Связь с таблицей Продукция</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПартииРезультат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ВетИС_ПоискСервер/Ext/Module.bsl
// GRACE:MODULE_START name="ВетИС_ПоискСервер"
// @grace-module: ВетИС_ПоискСервер
// @grace-purpose: Поиск и подбор партий ВетИС: актуальные остатки, подбор по продукции и производству
// @grace-depends: ВетИС_ЯдроСервер, ВетИС_ПараметрыСервер, ВетИС_APIСервер
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_ПоискСервер"
// GRACE:DEPENDENCY target="ВетИС_ЯдроСервер"
// GRACE:DEPENDENCY target="ВетИС_ПараметрыСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"

// GRACE:CONTRACT function="ВыбратьПартию"
// LLM_NOTE: Выбирает партию по критериям: количество > 0, площадка, хозсубъект.
//           Возвращает первую подходящую партию для списания в ВСД.
Функция ВыбратьПартию(Продукция_Элемент, Отправитель_Площадка, Отпр_ХозСубъект) Экспорт

	Если НЕ ЗначениеЗаполнено(Отправитель_Площадка) Тогда
         ВетИС_ЯдроСервер.СообщитьИнфо("Не указана площадка Отправителя!");
         Возврат "";
     КонецЕсли;
     Если НЕ ЗначениеЗаполнено(Отпр_ХозСубъект) Тогда
         Сообщить("Не указан ХС Отправителя!");
         Возврат "";
     КонецЕсли;


     Запрос = Новый Запрос;
     Запрос.Текст = "ВЫБРАТЬ
                    |	ВСД_Партия.Ссылка
                    |ИЗ
                    |	Справочник.ВСД_Партия КАК ВСД_Партия
                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.кб99_РезервПартийВСД.Остатки КАК РезервПартий
                    |		ПО ВСД_Партия.Ссылка = РезервПартий.Партия
                    |ГДЕ
                    |	ВСД_Партия.Получатель_Площадка = &Отправитель_Площадка
					|   И ВСД_Партия.Получатель_ХозСубъект.GUID = &ВыбХС
                    |	И ВСД_Партия.Продукция_Элемент = &Продукция_Элемент
                    |	И (ВСД_Партия.Количество - ЕСТЬNULL(РезервПартий.КоличествоОстаток, 0)) > 0
                    |	И ВСД_Партия.ПометкаУдаления = ЛОЖЬ";

     Запрос.УстановитьПараметр("Отправитель_Площадка"  ,Отправитель_Площадка);
	 Запрос.УстановитьПараметр("ВыбХС", Отпр_ХозСубъект.GUID);
     Запрос.УстановитьПараметр("Продукция_Элемент" , Продукция_Элемент);

     Выборка = Запрос.Выполнить().Выбрать();

     Если Выборка.Следующий() Тогда
         Возврат Выборка.Ссылка;
     Иначе
         Возврат Справочники.ВСД_Партия.ПустаяСсылка();
     КонецЕсли;

КонецФункции

// Формирует список Партий по Фильтру
// для заполнения ТЧ ВСД2_Инвентаризация
// GRACE:CONTRACT function="СписокАктуальныхПартийПоФильтру_Запрос"
Функция СписокАктуальныхПартийПоФильтру_Запрос(ВСД_Продукция_Элемент="",ВСД_Площадка="", ВСД_ХозСубъект="") Экспорт
	// ЖД ТЕСТ Выбор не Удаленных, не Пустых, по ВСД_Продукция_Элемент ,по Площадке
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|    ВСДПартия.Ссылка
	|ИЗ
	|    Справочник.ВСД_Партия КАК ВСДПартия
	|ГДЕ
	|    ВСДПартия.ПометкаУдаления = ЛОЖЬ
	|    И ВСДПартия.Количество > 0";
	Если ЗначениеЗаполнено(ВСД_Продукция_Элемент) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|    И ВСДПартия.Продукция_Элемент = &ВыбПродукция_Элемент";
	КонецЕсли;
	Если ЗначениеЗаполнено(ВСД_Площадка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|    И ВСДПартия.Получатель_Площадка = &ВыбПлощадка";
	КонецЕсли;
	Если ЗначениеЗаполнено(ВСД_ХозСубъект) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|    И ВСДПартия.Получатель_ХозСубъект.GUID = &ВыбХС";
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВыбПлощадка", ВСД_Площадка);
	Запрос.УстановитьПараметр("ВыбПродукция_Элемент",ВСД_Продукция_Элемент);
	Если ЗначениеЗаполнено(ВСД_ХозСубъект) Тогда
		Запрос.УстановитьПараметр("ВыбХС", ВСД_ХозСубъект.GUID);
	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#Область Партии

// GRACE:CONTRACT function="ПолучитьАктуальныеПартии"
// LLM_NOTE: Запрос актуальных партий из справочника ВСД_Партия с фильтрацией по продукции, площадке, хозсубъекту.
//           Поддерживает настраиваемую сортировку (FIFO/LIFO).
//           Является критическим местом для подбора партий при оформлении ВСД.
Функция ПолучитьАктуальныеПартии(Знач Параметры, ВыбПродукция_Элемент, ВыбПлощадка, ВыбХозСубъект, ПолеСортировкиПокупателя=Неопределено, ЗнакСортировкиПокупателя=Неопределено, Номенклатура=Неопределено ) Экспорт

	// LLM_NOTE: Исключение выбрасывается при некорректных входных параметрах.
	//           Это валидация контракта функции.
	Если НЕ ЗначениеЗаполнено(ВыбПлощадка)
			ИЛИ НЕ ЗначениеЗаполнено(ВыбХозСубъект) Тогда
		ВызватьИсключение "Не указаны параметры для подбора партий.";
	КонецЕсли;

	ЗнакСортировки = Параметры["ПарамЗнакСортировкиУбывание"];

	Если ЗначениеЗаполнено(ПолеСортировкиПокупателя) Тогда
		ПолеСортировки = ПолеСортировкиПокупателя;
		Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий определена = "+ПолеСортировки);
		КонецЕсли;
	Иначе
		Если ( ВыбПлощадка.ПерсональныеПараметрыСписанияПартий ) Тогда

			ПолеСортировки = ВыбПлощадка.ПарамКолонкаСортировкиПартииСписания;
			Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
				ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий определена в ВСД_Площадка ["+ВыбПлощадка+"] = "+ПолеСортировки);
			КонецЕсли;

			Если ЗначениеЗаполнено( ВыбПлощадка.ПарамЗнакСортировкиУбывание ) Тогда
				ЗнакСортировки = ВыбПлощадка.ПарамЗнакСортировкиУбывание;
				Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
					ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий по LIFO определена в ВСД_Площадка ["+ВыбПлощадка+"] = "+ЗнакСортировки);
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(Параметры["ПарамКолонкаСортировкиПартииСписания"]) Тогда
			ПолеСортировки = Параметры["ПарамКолонкаСортировкиПартииСписания"];
			Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
				ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий в общих параметрах = "+ПолеСортировки);
			КонецЕсли;
		Иначе
			ПолеСортировки = "ДатаИзменения";
			Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
				ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий в общих параметрах не определена, используем = "+ПолеСортировки);
			КонецЕсли;

		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗнакСортировкиПокупателя) Тогда
		ЗнакСортировки = ЗнакСортировкиПокупателя;
		Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("! Cортировка партий по LIFO = "+ЗнакСортировки);
		КонецЕсли;
	Иначе
		Если Параметры["ВыводитьПодробнуюИнформацию"] Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("! Сортировка партий по LIFO = "+ЗнакСортировки);
		КонецЕсли;
	КонецЕсли;
	ПорядокСортировки = ?(ЗнакСортировки,"ПолеСортировки УБЫВ","ПолеСортировки");

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	            |	ВСД_Партия.Ссылка КАК Партия,
	            |	ВСД_Партия.Количество,
	            |	ВСД_Партия.Продукция_Элемент КАК Продукция_Элемент,
	            |	ВСД_Партия.@ПолеСортировки КАК ПолеСортировки
	            |ИЗ
	            |	Справочник.ВСД_Партия КАК ВСД_Партия
	            |ГДЕ
	            |	ВСД_Партия.Получатель_Площадка = &Отправитель_Площадка
	            |	И ВСД_Партия.Получатель_ХозСубъект.GUID = &ВыбХС
	            |	И ВСД_Партия.Продукция_Элемент В ИЕРАРХИИ(&Продукция_Элемент)
	            |	И ВСД_Партия.Количество > 0
	            |	И ВСД_Партия.ПометкаУдаления = ЛОЖЬ
	            |
	            |УПОРЯДОЧИТЬ ПО
				// Не корректно работает сортировка по FIFO/LIFO если несколько соответствий
				//|	Продукция_Элемент,
	            |	@ПорядокПоляСортировки,
				|	Продукция_Элемент";

	 Запрос.Текст = СтрЗаменить(Запрос.Текст,"@ПолеСортировки",ПолеСортировки);
	 Запрос.Текст = СтрЗаменить(Запрос.Текст,"@ПорядокПоляСортировки",ПорядокСортировки);

	 // Контроль резервов партий: вычитаем зарезервированные количества из доступного остатка
	 Если ВетИС_ПараметрыСервер.ПроверитьЗначениеПараметра(Параметры, "КонтролироватьРезервыПартий")
		И Параметры["КонтролироватьРезервыПартий"] Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"ВСД_Партия.Количество,",
			"ВСД_Партия.Количество - ЕСТЬNULL(РезервПартий.КоличествоОстаток, 0) КАК Количество,");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"Справочник.ВСД_Партия КАК ВСД_Партия",
			"Справочник.ВСД_Партия КАК ВСД_Партия
			|ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.кб99_РезервПартийВСД.Остатки КАК РезервПартий
			|ПО ВСД_Партия.Ссылка = РезервПартий.Партия");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"И ВСД_Партия.Количество > 0",
			"И (ВСД_Партия.Количество - ЕСТЬNULL(РезервПартий.КоличествоОстаток, 0)) > 0");
	 КонецЕсли;

     Запрос.УстановитьПараметр("Отправитель_Площадка"  ,ВыбПлощадка);
	 Запрос.УстановитьПараметр("ВыбХС", ВыбХозСубъект.GUID);
     Запрос.УстановитьПараметр("Продукция_Элемент" , ВыбПродукция_Элемент);

	 Если Не Номенклатура = Неопределено Тогда
	     ВыбПродукция_Элемент = Новый СписокЗначений;
	     Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
	    	 Для а=0 По  Номенклатура.Количество()-1 Цикл
	    		 тзСписок = ВетИС_ЯдроСервер.ПолучитьСписок_ВСД_Продукция_ЭлементПоНоменклатуре( Номенклатура[а] );
	    		 Для Каждого стрТЗСписок Из  тзСписок Цикл
	    			 ВыбПродукция_Элемент.Добавить(стрТЗСписок.ПродукцияЭлемент);
	    		 КонецЦикла;
	    	 КонецЦикла;
	     Иначе
	    	 тзСписок = ВетИС_ЯдроСервер.ПолучитьСписок_ВСД_Продукция_ЭлементПоНоменклатуре( Номенклатура );
	    	 Для Каждого стрТЗСписок Из  тзСписок Цикл
	    		 ВыбПродукция_Элемент.Добавить(стрТЗСписок.ПродукцияЭлемент);
	    	 КонецЦикла;
	     КонецЕсли;
	     Запрос.Текст = СтрЗаменить(Запрос.Текст,"И ВСД_Партия.Продукция_Элемент В ИЕРАРХИИ(&Продукция_Элемент)","И ВСД_Партия.Продукция_Элемент В (&Продукция_Элемент)");
	     Запрос.УстановитьПараметр("Продукция_Элемент" , ВыбПродукция_Элемент);
	 КонецЕсли;

	 Попытка
		 Возврат Запрос.Выполнить().Выгрузить();
	 Исключение
		 ВетИС_ЯдроСервер.СообщитьИнфо("Указано неверное название реквизита сортировки Партий в Параметрах -> "+ПолеСортировки+" исправьте!!");
		 ВетИС_ЯдроСервер.СообщитьИнфо(ОписаниеОшибки());
		 Возврат "";
	 КонецПопытки;

КонецФункции

// GRACE:CONTRACT function="ПодобратьПартииПоПродукцияЭлемент_"
// LLM_NOTE: Подбор партий по одному элементу продукции с учетом срока годности.
//           Внутренняя версия функции для обработки таблицы партий.
Функция ПодобратьПартииПоПродукцияЭлемент_( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры="", Номенклатура=Неопределено, Контрагент = Неопределено ) Экспорт

	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ПодобратьПартииПоПродукцияЭлемент");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПодобратьПартииПоПродукцияЭлемент( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры, Номенклатура, Контрагент );
	КонецЕсли;

	// Подбираем партии под нужное количество списания
	// возвращает ТЗ - Партия и Вес для указанного ПродукцияЭлемент
	// ТзПартий уже отсортирована нужным образом
	// Мы должны вернуть ее с уменьшенным количеством, что необходимо при групповой обработке

    тзОтвет = Новый ТаблицаЗначений;
	тзОтвет.Колонки.Добавить("Партия");
	тзОтвет.Колонки.Добавить("Количество");
	тзОтвет.Колонки.Добавить("Упаковки");  // Не нужен похоже тут
	тзОтвет.Колонки.Добавить("ПолеСортировки"); // Не исп-ся в документе
	тзОтвет.Колонки.Добавить("Номенклатура");

	Если Не ЗначениеЗаполнено(ПродукцияЭлемент) И Не ЗначениеЗаполнено(Номенклатура) Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Не переданы данные о продукции при подборе партий");
		Возврат тзОтвет;
	КонецЕсли;

	ОсталосьСписать = КолвоСписания;
	Если ЗначениеЗаполнено(тзПартий) Тогда
		Если (Номенклатура = Неопределено) Или НЕ(ЗначениеЗаполнено(Номенклатура))  Тогда
			НайденнаяСтрока = тзПартий.Найти(ПродукцияЭлемент, "Продукция_Элемент");
			Если ЗначениеЗаполнено( НайденнаяСтрока ) Тогда

				НомерСтроки = тзПартий.Индекс(НайденнаяСтрока);

				Для А=НомерСтроки По тзПартий.Количество()-1 Цикл

					Если тзПартий[А].Продукция_Элемент <> ПродукцияЭлемент Тогда
						Продолжить;
					КонецЕсли;

					Если тзПартий[А].Партия.ИсключенаИзПодбора Тогда
						Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
							ВетИС_ЯдроСервер.СообщитьИнфо(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Партия [%1], с номером записи [%2] была исключена из подбора", тзПартий[А].Партия.Наименование, тзПартий[А].Партия.НомерЗаписи), тзПартий[А].Партия);
						КонецЕсли;
						Продолжить;
					КонецЕсли;


					Если осталосьСписать = 0 Тогда
						Прервать;
					КонецЕсли;

					Если тзПартий[А].Количество = 0 Тогда
						// Уже выбрали из этой партии все
						Продолжить;
					КонецЕсли;

					Если НЕ ПараметрыФункции["ПоказыватьПросроченныеПартии"] Тогда

						Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда

							ДатаСрокГодности2= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности2 );

							Если ДатаСрокГодности2 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
								Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
									ВетИС_ЯдроСервер.СообщитьИнфо( тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности2,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
								КонецЕсли;
								Продолжить;
							КонецЕсли;

						Иначе

							ДатаСрокГодности1= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности1 );
							Если ДатаСрокГодности1 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
								Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
									ВетИС_ЯдроСервер.СообщитьИнфо(тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности1,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
								КонецЕсли;
								Продолжить;
							КонецЕсли;

						КонецЕсли;

					КонецЕсли;

					//    // проверка по сроку годности в СерииНоменклатуры
					//	Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда
					//
					//		Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаИзготовления2 ) Тогда
					//
					//			Если тзПартий[А].Партия.ДатаИзготовления2 < СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//			Если тзПартий[А].Партия.ДатаИзготовления1 > СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//
					//			Если  ( тзПартий[А].Партия.ДатаСрокГодности1 > СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//				Продолжить;
					//			КонецЕсли;
					//			Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
					//				Если  ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			КонецЕсли;
					//
					//		Иначе
					//
					//			// сравниваем ТОЛЬКО по ДатаДатаИзготовления1
					//			Если тзПартий[А].Партия.ДатаИзготовления1 <> СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//
					//			Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
					//				Если ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			Иначе
					//				Если  ( тзПартий[А].Партия.ДатаСрокГодности1 <> СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			КонецЕсли;
					//
					//		КонецЕсли;
					//
					//	КонецЕсли;

					// иначе
					СтрокаОтвет = тзОтвет.Добавить();
					СтрокаОтвет.Партия = тзПартий[А].Партия;
					СтрокаОтвет.ПолеСортировки = тзПартий[А].ПолеСортировки;
					Если ОсталосьСписать >= тзПартий[А].Количество Тогда
						СтрокаОтвет.Количество = тзПартий[А].Количество;
					Иначе
						СтрокаОтвет.Количество = ОсталосьСписать;
					КонецЕсли;

					тзПартий[А].Количество = тзПартий[А].Количество - СтрокаОтвет.Количество;
					ОсталосьСписать = ОсталосьСписать - СтрокаОтвет.Количество;

				КонецЦикла;
			КонецЕсли;
		Иначе   //по списку номенклатуры
			СписокПродукцияЭлемент = ВетИС_ЯдроСервер.Продукция_Элемент_ПолучитьСписок_ПоНоменклатуреИКонтрагенту( Номенклатура, Контрагент );
			Для Каждого ПродукцияЭлемент Из  СписокПродукцияЭлемент Цикл
				НайденнаяСтрока = тзПартий.Найти(ПродукцияЭлемент, "Продукция_Элемент");
				Если ЗначениеЗаполнено( НайденнаяСтрока ) Тогда
					НомерСтроки = тзПартий.Индекс(НайденнаяСтрока);

					Для А=НомерСтроки По тзПартий.Количество()-1 Цикл

						Если тзПартий[А].Продукция_Элемент <> ПродукцияЭлемент Тогда
							Продолжить;
						КонецЕсли;

						Если тзПартий[А].Партия.ИсключенаИзПодбора Тогда
							Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
								ВетИС_ЯдроСервер.СообщитьИнфо(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Партия [%1], с номером записи [%2] была исключена из подбора", тзПартий[А].Партия.Наименование, тзПартий[А].Партия.НомерЗаписи), тзПартий[А].Партия);
							КонецЕсли;
							Продолжить;
						КонецЕсли;

						Если осталосьСписать = 0 Тогда
							Прервать;
						КонецЕсли;

						Если тзПартий[А].Количество = 0 Тогда
							// Уже выбрали из этой партии все
							Продолжить;
						КонецЕсли;

						Если НЕ ПараметрыФункции["ПоказыватьПросроченныеПартии"] Тогда

							Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда

								ДатаСрокГодности2= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности2 );

								Если ДатаСрокГодности2 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
									Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
										ВетИС_ЯдроСервер.СообщитьИнфо( тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности2,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
									КонецЕсли;
									Продолжить;
								КонецЕсли;

							Иначе

								ДатаСрокГодности1= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности1 );
								Если ДатаСрокГодности1 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
									Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
										ВетИС_ЯдроСервер.СообщитьИнфо(тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности1,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
									КонецЕсли;
									Продолжить;
								КонецЕсли;

							КонецЕсли;

						КонецЕсли;

						// проверка по сроку годности в СерииНоменклатуры
						Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда

							Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаИзготовления2 ) Тогда

								//Если тзПартий[А].Партия.ДатаИзготовления2 < СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;
								//Если тзПартий[А].Партия.ДатаИзготовления1 > СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;

								Если  ( тзПартий[А].Партия.ДатаСрокГодности1 > СерияНоменклатуры.ГоденДо ) Тогда
									Продолжить;
								КонецЕсли;
								Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
									Если  ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;

							Иначе

								// сравниваем ТОЛЬКО по ДатаДатаИзготовления1
								//Если тзПартий[А].Партия.ДатаИзготовления1 <> СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;

								Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
									Если ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								Иначе
									Если  ( тзПартий[А].Партия.ДатаСрокГодности1 <> СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;

							КонецЕсли;

						КонецЕсли;

						// иначе
						СтрокаОтвет = тзОтвет.Добавить();
						СтрокаОтвет.Партия = тзПартий[А].Партия;
						СтрокаОтвет.ПолеСортировки = тзПартий[А].ПолеСортировки;
						Если ОсталосьСписать >= тзПартий[А].Количество Тогда
							СтрокаОтвет.Количество = тзПартий[А].Количество;
						Иначе
							СтрокаОтвет.Количество = ОсталосьСписать;
						КонецЕсли;

						тзПартий[А].Количество = тзПартий[А].Количество - СтрокаОтвет.Количество;
						ОсталосьСписать = ОсталосьСписать - СтрокаОтвет.Количество;

					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли
	КонецЕсли;

	Если ОсталосьСписать > 0 Тогда
	    стр = "Недостаточно партий для списания "+ПродукцияЭлемент + ", Нужно списать "+КолвоСписания+ ", списываю "+тзОтвет.Итог("Количество");
		Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда
			стр = стр + " со сроком годности  по ["+СерияНоменклатуры.ГоденДо+"]";
		КонецЕсли;
		стр = стр + " на площадке №" +ПараметрыФункции.Отправитель_Площадка.Код + "  " + ПараметрыФункции.Отправитель_Площадка;
		ВетИС_ЯдроСервер.СообщитьИнфо(стр);
	КонецЕсли;

	Возврат тзОтвет;

КонецФункции

// GRACE:CONTRACT function="ПодобратьПартииПоПродукцияЭлемент"
// LLM_NOTE: Подбор партий по элементу продукции с контролем срока годности.
//           Является критическим местом для подбора партий при оформлении ВСД.
Функция ПодобратьПартииПоПродукцияЭлемент( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры="", Номенклатура=Неопределено, Контрагент = Неопределено ) Экспорт

	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("ПодобратьПартииПоПродукцияЭлемент");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.ПодобратьПартииПоПродукцияЭлемент( ПараметрыФункции, тзПартий, ПродукцияЭлемент, КолвоСписания, СерияНоменклатуры, Номенклатура, Контрагент );
	КонецЕсли;

	// Подбираем партии под нужное количество списания
	// возвращает ТЗ - Партия и Вес для указанного ПродукцияЭлемент
	// ТзПартий уже отсортирована нужным образом
	// Мы должны вернуть ее с уменьшенным количеством, что необходимо при групповой обработке

    тзОтвет = Новый ТаблицаЗначений;
	тзОтвет.Колонки.Добавить("Партия");
	тзОтвет.Колонки.Добавить("Количество");
	тзОтвет.Колонки.Добавить("Упаковки");  // Не нужен похоже тут
	тзОтвет.Колонки.Добавить("ПолеСортировки"); // Не исп-ся в документе
	тзОтвет.Колонки.Добавить("Номенклатура");

	Если Не ЗначениеЗаполнено(ПродукцияЭлемент) И Не ЗначениеЗаполнено(Номенклатура) Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Не переданы данные о продукции при подборе партий");
		Возврат тзОтвет;
	КонецЕсли;

	ОсталосьСписать = КолвоСписания;
	Если ЗначениеЗаполнено(тзПартий) Тогда
		Если (Номенклатура = Неопределено) Или НЕ(ЗначениеЗаполнено(Номенклатура))  Тогда
			НайденнаяСтрока = тзПартий.Найти(ПродукцияЭлемент, "Продукция_Элемент");
			Если ЗначениеЗаполнено( НайденнаяСтрока ) Тогда

				НомерСтроки = тзПартий.Индекс(НайденнаяСтрока);

				Для А=НомерСтроки По тзПартий.Количество()-1 Цикл

					Если тзПартий[А].Продукция_Элемент <> ПродукцияЭлемент Тогда
						Продолжить;
					КонецЕсли;

					Если тзПартий[А].Партия.ИсключенаИзПодбора Тогда
						Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
							ВетИС_ЯдроСервер.СообщитьИнфо(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Партия [%1], с номером записи [%2] была исключена из подбора", тзПартий[А].Партия.Наименование, тзПартий[А].Партия.НомерЗаписи), тзПартий[А].Партия);
						КонецЕсли;
						Продолжить;
					КонецЕсли;


					Если осталосьСписать = 0 Тогда
						Прервать;
					КонецЕсли;

					Если тзПартий[А].Количество = 0 Тогда
						// Уже выбрали из этой партии все
						Продолжить;
					КонецЕсли;

					Если НЕ ПараметрыФункции["ПоказыватьПросроченныеПартии"] Тогда

						Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда

							ДатаСрокГодности2= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности2 );

							Если ДатаСрокГодности2 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
								Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
									ВетИС_ЯдроСервер.СообщитьИнфо( тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности2,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
								КонецЕсли;
								Продолжить;
							КонецЕсли;

						Иначе

							ДатаСрокГодности1= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности1 );
							Если ДатаСрокГодности1 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
								Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
									ВетИС_ЯдроСервер.СообщитьИнфо(тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности1,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
								КонецЕсли;
								Продолжить;
							КонецЕсли;

						КонецЕсли;

					КонецЕсли;

					//    // проверка по сроку годности в СерииНоменклатуры
					//	Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда
					//
					//		Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаИзготовления2 ) Тогда
					//
					//			Если тзПартий[А].Партия.ДатаИзготовления2 < СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//			Если тзПартий[А].Партия.ДатаИзготовления1 > СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//
					//			Если  ( тзПартий[А].Партия.ДатаСрокГодности1 > СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//				Продолжить;
					//			КонецЕсли;
					//			Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
					//				Если  ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			КонецЕсли;
					//
					//		Иначе
					//
					//			// сравниваем ТОЛЬКО по ДатаДатаИзготовления1
					//			Если тзПартий[А].Партия.ДатаИзготовления1 <> СерияНоменклатуры.СрокГодности Тогда
					//				Продолжить;
					//			КонецЕсли;
					//
					//			Если ЗначениеЗаполнено( тзПартий[А].Партия.ДатаСрокГодности2 ) Тогда
					//				Если ( тзПартий[А].Партия.ДатаСрокГодности2 < СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			Иначе
					//				Если  ( тзПартий[А].Партия.ДатаСрокГодности1 <> СерияНоменклатуры.СМК_ГоденДо ) Тогда
					//					Продолжить;
					//				КонецЕсли;
					//			КонецЕсли;
					//
					//		КонецЕсли;
					//
					//	КонецЕсли;

					// иначе
					СтрокаОтвет = тзОтвет.Добавить();
					СтрокаОтвет.Партия = тзПартий[А].Партия;
					СтрокаОтвет.ПолеСортировки = тзПартий[А].ПолеСортировки;
					Если ОсталосьСписать >= тзПартий[А].Количество Тогда
						СтрокаОтвет.Количество = тзПартий[А].Количество;
					Иначе
						СтрокаОтвет.Количество = ОсталосьСписать;
					КонецЕсли;

					тзПартий[А].Количество = тзПартий[А].Количество - СтрокаОтвет.Количество;
					ОсталосьСписать = ОсталосьСписать - СтрокаОтвет.Количество;

				КонецЦикла;
			КонецЕсли;
		Иначе   //по списку номенклатуры
			СписокПродукции = ВетИС_ЯдроСервер.Продукция_Элемент_ПолучитьСписок_ПоНоменклатуреИКонтрагенту( Номенклатура, Контрагент );
			// тзПартий отсортирована в запросе по выбранному методу
			Для Каждого стрПартии Из  тзПартий Цикл

				Если СписокПродукции.Найти(стрПартии.Продукция_Элемент) = Неопределено Тогда
					Продолжить;
				КонецЕсли;

				//ПродукцияЭлемент = стрТЗСписок.ПродукцияЭлемент;
				//НайденнаяСтрока = тзПартий.Найти(ПродукцияЭлемент, "Продукция_Элемент");
				//Если ЗначениеЗаполнено( НайденнаяСтрока ) Тогда
					//НомерСтроки = тзПартий.Индекс(НайденнаяСтрока);

					//Для А=НомерСтроки По тзПартий.Количество()-1 Цикл

						//Если тзПартий[А].Продукция_Элемент <> ПродукцияЭлемент Тогда
						//	Продолжить;
						//КонецЕсли;

						Если стрПартии.Партия.ИсключенаИзПодбора Тогда
							Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
								ВетИС_ЯдроСервер.СообщитьИнфо(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Партия [%1], с номером записи [%2] была исключена из подбора",
										стрПартии.Партия.Наименование,
										стрПартии.Партия.НомерЗаписи),
									стрПартии.Партия);
							КонецЕсли;
							Продолжить;
						КонецЕсли;

						Если осталосьСписать = 0 Тогда
							Прервать;
						КонецЕсли;

						Если стрПартии.Количество = 0 Тогда
							// Уже выбрали из этой партии все
							Продолжить;
						КонецЕсли;

						Если НЕ ПараметрыФункции["ПоказыватьПросроченныеПартии"] Тогда

							//Если ЗначениеЗаполнено( стрПартии.Партия.ДатаСрокГодности2 ) Тогда
							//
							//	ДатаСрокГодности2= ВетИС_APIСервер.СтрокаВДатаВремя( тзПартий[А].Партия.ДатаСрокГодности2 );
							//
							//	Если ДатаСрокГодности2 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
							//		Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
							//			ВетИС_ЯдроСервер.СообщитьИнфо( тзПартий[А].Партия.Наименование + " пропущена по сроку годности: " + Формат(ДатаСрокГодности2,"ДФ=dd.MM.yy"), тзПартий[А].Партия);
							//		КонецЕсли;
							//		Продолжить;
							//	КонецЕсли;
							//
							//Иначе

								// в меркурии контроль по перволму сроку годности
								ДатаСрокГодности1= ВетИС_APIСервер.СтрокаВДатаВремя( стрПартии.Партия.ДатаСрокГодности1 );
								Если ДатаСрокГодности1 <= ТекущаяДата()+ПараметрыФункции["СрокГодностиДней"]*86400 Тогда
									Если ПараметрыФункции["ВыводитьПодробнуюИнформацию"] Тогда
										ВетИС_ЯдроСервер.СообщитьИнфо(стрПартии.Партия.Наименование + " пропущена по сроку годности: " +
											Формат(ДатаСрокГодности1, "ДФ=dd.MM.yy"), стрПартии.Партия);
									КонецЕсли;
									Продолжить;
								КонецЕсли;

							//КонецЕсли;

						КонецЕсли;

						// проверка по сроку годности в СерииНоменклатуры
						Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда

							Если ЗначениеЗаполнено( стрПартии.Партия.ДатаИзготовления2 ) Тогда

								//Если тзПартий[А].Партия.ДатаИзготовления2 < СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;
								//Если тзПартий[А].Партия.ДатаИзготовления1 > СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;

								Если  ( стрПартии.Партия.ДатаСрокГодности1 > СерияНоменклатуры.ГоденДо ) Тогда
									Продолжить;
								КонецЕсли;
								Если ЗначениеЗаполнено( стрПартии.Партия.ДатаСрокГодности2 ) Тогда
									Если  ( стрПартии.Партия.ДатаСрокГодности2 < СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;

							Иначе

								// сравниваем ТОЛЬКО по ДатаДатаИзготовления1
								//Если тзПартий[А].Партия.ДатаИзготовления1 <> СерияНоменклатуры.СрокГодности Тогда
								//	Продолжить;
								//КонецЕсли;

								Если ЗначениеЗаполнено(стрПартии.Партия.ДатаСрокГодности2 ) Тогда
									Если ( стрПартии.Партия.ДатаСрокГодности2 < СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								Иначе
									Если  ( стрПартии.Партия.ДатаСрокГодности1 <> СерияНоменклатуры.ГоденДо ) Тогда
										Продолжить;
									КонецЕсли;
								КонецЕсли;

							КонецЕсли;

						КонецЕсли;

						// иначе
						СтрокаОтвет = тзОтвет.Добавить();
						СтрокаОтвет.Партия = стрПартии.Партия;
						СтрокаОтвет.ПолеСортировки = стрПартии.ПолеСортировки;
						Если ОсталосьСписать >= стрПартии.Количество Тогда
							СтрокаОтвет.Количество = стрПартии.Количество;
						Иначе
							СтрокаОтвет.Количество = ОсталосьСписать;
						КонецЕсли;

						стрПартии.Количество = стрПартии.Количество - СтрокаОтвет.Количество;
						ОсталосьСписать = ОсталосьСписать - СтрокаОтвет.Количество;

					//КонецЦикла;
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли
	КонецЕсли;

	Если ОсталосьСписать > 0 Тогда
	    стр = "Недостаточно партий для списания по номенклатуре " + Номенклатура + ", Нужно списать "+КолвоСписания+ ", списываю "+тзОтвет.Итог("Количество");
		Если ЗначениеЗаполнено( СерияНоменклатуры ) Тогда
			стр = стр + " со сроком годности  по ["+СерияНоменклатуры.ГоденДо+"]";
		КонецЕсли;
		стр = стр + " на площадке №" +ПараметрыФункции.Отправитель_Площадка.Код + "  " + ПараметрыФункции.Отправитель_Площадка;
		ВетИС_ЯдроСервер.СообщитьИнфо(стр);
	КонецЕсли;

	Возврат тзОтвет;

КонецФункции

// GRACE:CONTRACT function="ПодобратьПартии"
Функция ПодобратьПартии( тзПартий, КолвоСписания ) Экспорт
	// Подбираем партии под нужное количество списания
	// возвращает ТЗ - Партия и Вес для указанного ПродукцияЭлемент
	// тзПартий уже отсортирована нужным образом
	// Мы должны вернуть ее с уменьшенным количеством, что необходимо при групповой обработке

    Рез = Новый ТаблицаЗначений;
	Рез.Колонки.Добавить("Партия");
	Рез.Колонки.Добавить("Количество");

	ОсталосьСписать = КолвоСписания;
	Если НЕ ЗначениеЗаполнено(ТзПартий) Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Не заполнена таблица партий ");
		Возврат Рез;
	КонецЕсли;
	Для Каждого стрПартия Из тзПартий Цикл
			Если осталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли;

			СтрРез = рез.Добавить();
			СтрРез.Партия = стрПартия.Партия;

			Если ОсталосьСписать >= стрПартия.Количество Тогда
				СтрРез.Количество = стрПартия.Количество;
			Иначе
				СтрРез.Количество = ОсталосьСписать;
			КонецЕсли;

			стрПартия.Количество = стрПартия.Количество - СтрРез.Количество;
			ОсталосьСписать = ОсталосьСписать - СтрРез.Количество;
	КонецЦикла;

	Если ОсталосьСписать > 0 Тогда
	    ВетИС_ЯдроСервер.СообщитьИнфо("Недостаточно партий для списания, нужно списать "+КолвоСписания+ ", списываю "+Рез.Итог("Количество"));
	КонецЕсли;

	Возврат рез;

КонецФункции

// Аналог Процедуры ЗаполнитьТЧВСД, только вместо заполнения ТЧ документа Возвращает ТЗ
// рассмотреть вариант Оптимизации
// Параметр тзАктуальныхПартий необходим при групповом рспределении
// в Парам = Структура переданы Отправитель_ХозСубъект и Отправитель_Площадка
//
// ПолеСортировки = выборочные настройки Получателя_ХозСубъекта
// ЗнакСортировки = выборочные настройки Получателя_ХозСубъекта
//
// GRACE:CONTRACT function="тзПартииСписанияПоТзПродукция_Элемент"
// LLM_NOTE: Главная функция подбора партий для списания по списку элементов продукции.
//           Поддерживает переопределение через ВетИС_УтилитыКлиентСервер.
Функция тзПартииСписанияПоТзПродукция_Элемент(Параметры, тзЭлементыкСписанию, тзАктуальныхПартий = "", ПолеСортировки=Неопределено, ЗнакСортировки = Неопределено, Контрагент = Неопределено) Экспорт

	ПереопределенныйМодуль = ВетИС_УтилитыКлиентСервер.ФункцияПереопределена("тзПартииСписанияПоТзПродукция_Элемент");
	Если ПереопределенныйМодуль <> Неопределено Тогда
		Возврат ПереопределенныйМодуль.тзПартииСписанияПоТзПродукция_Элемент(Параметры, тзЭлементыкСписанию, тзАктуальныхПартий, ПолеСортировки, ЗнакСортировки, Контрагент);
	КонецЕсли;

    ПартииКСписанию = новый ("ТаблицаЗначений");
    ПартииКСписанию.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
    ПартииКСписанию.Колонки.Добавить("Продукция_Элемент", Новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция_Элемент"));
    ПартииКСписанию.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.ВСД_Продукция"));
    ПартииКСписанию.Колонки.Добавить("ВидПродукции", Новый ОписаниеТипов("СправочникСсылка.ВСД_ВидПродукции"));
    ПартииКСписанию.Колонки.Добавить("Партия", Новый ОписаниеТипов("СправочникСсылка.ВСД_Партия"));
    ПартииКСписанию.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
	ПартииКСписанию.Колонки.Добавить("Количество1с", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
    ПартииКСписанию.Колонки.Добавить("Упаковки", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
    ПартииКСписанию.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.ВСД_ЕдиницыИзмерения"));
    ПартииКСписанию.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36)));

    Если НЕ ЗначениеЗаполнено(тзАктуальныхПартий) Тогда
		Попытка массивНоменклатура = тзЭлементыкСписанию.ВыгрузитьКолонку("Номенклатура")Исключение массивНоменклатура = Неопределено КонецПопытки;
        Попытка
            тзАктуальныхПартий = ПолучитьАктуальныеПартии(Параметры, тзЭлементыкСписанию.ВыгрузитьКолонку("Продукция_Элемент"), Параметры["Отправитель_Площадка"], Параметры["Отправитель_ХозСубъект"],
				ПолеСортировки, ЗнакСортировки, массивНоменклатура );
        Исключение
            ВетИС_ЯдроСервер.СообщитьИнфо("Не переданы параметры для получения Актуальных партий - ДанныеЗаполнения или тзЭлементыОснования");
            Возврат ПартииКСписанию;
        КонецПопытки;
    КонецЕсли;

    Для Каждого ТекСтрокаТовары Из тзЭлементыкСписанию Цикл
		Продукция_Элемент = ТекСтрокаТовары.Продукция_Элемент;
		Если Контрагент = Неопределено Тогда
			Попытка
				Контрагент = ТекСтрокаТовары.Контрагент;
			Исключение
			КонецПопытки;
		КонецЕсли;
		Попытка
			СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
		Исключение
			СерияНоменклатуры = Неопределено;
		КонецПопытки;
		Попытка
			Номенклатура = ТекСтрокаТовары.Номенклатура;
		Исключение
			Номенклатура = Неопределено;
		КонецПопытки;

		СтрокиПартий = ПодобратьПартииПоПродукцияЭлемент( Параметры, тзАктуальныхПартий, ТекСтрокаТовары.Продукция_Элемент, ТекСтрокаТовары.Количество, СерияНоменклатуры, Номенклатура, Контрагент );
		Коэфициент1с = ТекСтрокаТовары.Количество / ?(ТекСтрокаТовары.Количество1с = 0, 1, ТекСтрокаТовары.Количество1с);

        Если СтрокиПартий.Количество() = 0  Тогда
            Если Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"] Тогда
                НоваяСтрока = ПартииКСписанию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары);
                НоваяСтрока.Продукция_Элемент = Продукция_Элемент;
                НоваяСтрока.ЕдиницаИзмерения = Продукция_Элемент.ЕдиницаИзмерения;
                Продолжить;
            КонецЕсли;
              ВетИС_ЯдроСервер.СообщитьИнфо("Нет партий для Продукция_Элемент ["+ Строка(Продукция_Элемент) +"] Пропускаем!");
            Продолжить;
        КонецЕсли;

        Для Каждого СтрПартии Из СтрокиПартий Цикл
			НоваяСтрока = ПартииКСписанию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары,, "Количество1с");
            НоваяСтрока.Партия = СтрПартии.Партия;
            НоваяСтрока.Количество = СтрПартии.Количество;
            НоваяСтрока.ЕдиницаИзмерения = СтрПартии.Партия.ЕдиницаИзмерения;
            НоваяСтрока.Продукция_Элемент = НоваяСтрока.Партия.Продукция_Элемент;
            НоваяСтрока.Продукция = НоваяСтрока.Партия.Продукция;
            НоваяСтрока.ВидПродукции = НоваяСтрока.Партия.ВидПродукции;
			НоваяСтрока.Количество1с = НоваяСтрока.Количество / Коэфициент1с;
			//НоваяСтрока.СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
        КонецЦикла;

        Если (СтрокиПартий.Итог("Количество") < ТекСтрокаТовары.Количество) и Параметры["ПарамЗаполнятьТранзакциюПриОтсутствииПартий"]  Тогда
            //Добавим с пустыми партиями
            НоваяСтрока = ПартииКСписанию.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары,, "Количество1с");
            НоваяСтрока.Продукция_Элемент = Продукция_Элемент;
            НоваяСтрока.Количество  =  ТекСтрокаТовары.Количество - СтрокиПартий.Итог("Количество");
			НоваяСтрока.Количество1с = НоваяСтрока.Количество / Коэфициент1с;
            НоваяСтрока.ЕдиницаИзмерения = Продукция_Элемент.ЕдиницаИзмерения;
		КонецЕсли;

    КонецЦикла;

	ПартииКСписанию.Свернуть("Номенклатура, Продукция_Элемент, Продукция, ВидПродукции, Партия, ЕдиницаИзмерения, ИдентификаторСтроки","Количество, Упаковки, Количество1с");

    Возврат ПартииКСписанию;

КонецФункции

// GRACE:CONTRACT function="ПолучитьПартииПоДокументамПроизводства"
// LLM_NOTE: Получение партий, созданных в результате оформления производства.
//           Используется для корректного заполнения табличной части партий списания.
Функция ПолучитьПартииПоДокументамПроизводства(СписокДокументов, ПолеСортировки) Экспорт

	СписокДокументов = ВетИС_УтилитыКлиентСервер.СвернутьМассив(СписокДокументов);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	кб99_ВСД2.Ссылка КАК ВСД,
		|	ВСД_Партия.Ссылка КАК Партия,
		|	кб99_ВСД2.ДокументОснование КАК ДокПроизводство,
		|	ВСД_Партия.Продукция_Элемент КАК Продукция_Элемент,
		|	ВСД_Партия.Количество КАК Количество,
		|	ВСД_Партия.@ПолеСортировки КАК ПолеСортировки
		|ИЗ
		|	Справочник.кб99_ВСД2 КАК кб99_ВСД2
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВСД_Партия КАК ВСД_Партия
		|		ПО (ВСД_Партия.vetDocument = кб99_ВСД2.Ссылка)
		|ГДЕ
		|	кб99_ВСД2.ДокументОснование ССЫЛКА Документ.ВСД2_Производство
		|	И кб99_ВСД2.ДокументОснование В(&СписокДокументов)";

	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "@ПолеСортировки" , ПолеСортировки);
	РезультатЗапроса = Запрос.Выполнить();

	тзРезультат = РезультатЗапроса.Выгрузить();

	Возврат тзРезультат;

КонецФункции

#КонецОбласти

// GRACE:MODULE_END name="ВетИС_ПоискСервер"
